zmzdh/CAN_st_test/Drivers/FM33FG0xxA_FL_Driver/Src/fm33fg0xxa_fl_can.c
 /**    
  *******************************************************************************************************
  * @file    fm33fg0xxa_fl_can.c
  * @author  FMSH Application Team
  * @brief   Source file of CAN FL Module
  *******************************************************************************************************   
  * @attention    
  * Copyright (c) 2023, SHANGHAI FUDAN MICROELECTRONICS GROUP CO., LTD.(FUDAN MICROELECTRONICS./ FUDAN MICRO.)    
  * All rights reserved.    
  *    
  * Processor:                   FM33FG0xxA    
  * http:                        http://www.fmdevelopers.com.cn/    
  *    
  * Redistribution and use in source and binary forms, with or without    
  * modification, are permitted provided that the following conditions are met    
  *    
  * 1. Redistributions of source code must retain the above copyright notice,    
  *    this list of conditions and the following disclaimer.    
  *    
  * 2. Redistributions in binary form must reproduce the above copyright notice,    
  *    this list of conditions and the following disclaimer in the documentation    
  *    and/or other materials provided with the distribution.    
  *    
  * 3. Neither the name of the copyright holder nor the names of its contributors    
  *    may be used to endorse or promote products derived from this software    
  *    without specific prior written permission.    
  *    
  * 4. To provide the most up-to-date information, the revision of our documents     
  *    on the World Wide Web will be the most Current. Your printed copy may be      
  *    an earlier revision. To verify you have the latest information avaliable,    
  *    refer to: http://www.fmdevelopers.com.cn/.    
  *    
  * THIS SOFTWARE IS PROVIDED BY FUDAN MICRO "AS IS" AND ANY EXPRESSED:     
  * ORIMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES     
  * OF MERCHANTABILITY NON-INFRINGEMENT AND FITNESS FOR A PARTICULAR PURPOSE    
  * ARE DISCLAIMED.IN NO EVENT SHALL FUDAN MICRO OR ITS CONTRIBUTORS BE LIABLE     
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL     
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS     
  * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER    
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,     
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISINGIN ANY WAY OUT OF THE     
  * USE OF THIS SOFTWARE, EVEN IF ADVISED OFTHE POSSIBILITY OF SUCH DAMAGE.    
  *
  *******************************************************************************************************
  */    

/* Includes ------------------------------------------------------------------*/
#include "fm33fg0xxa_fl.h"
/** @addtogroup FM33FG0XXA_FL_Driver
  * @{
  */

/** @addtogroup CAN
  * @{
  */

#ifdef FL_CAN_DRIVER_ENABLED

/* Private macros ------------------------------------------------------------*/
/** @addtogroup CAN_FL_Private_Macros
  * @{
  */


#define     IS_CAN_INSTANCE(INSTANCE)                     (((INSTANCE) == CAN))
                                                         
#define     IS_CAN_SJW(__VALUE__)                        (((__VALUE__) == FL_CAN_SJW_1Tq) ||\
                                                          ((__VALUE__) == FL_CAN_SJW_2Tq) ||\
                                                          ((__VALUE__) == FL_CAN_SJW_3Tq) ||\
                                                          ((__VALUE__) == FL_CAN_SJW_4Tq))
                                                         
#define     IS_CAN_TS1(__VALUE__)                        (((__VALUE__) == FL_CAN_TS1_1Tq) ||\
                                                          ((__VALUE__) == FL_CAN_TS1_2Tq) ||\
                                                          ((__VALUE__) == FL_CAN_TS1_3Tq) ||\
                                                          ((__VALUE__) == FL_CAN_TS1_4Tq) ||\
                                                          ((__VALUE__) == FL_CAN_TS1_5Tq) ||\
                                                          ((__VALUE__) == FL_CAN_TS1_6Tq) ||\
                                                          ((__VALUE__) == FL_CAN_TS1_7Tq) ||\
                                                          ((__VALUE__) == FL_CAN_TS1_8Tq) ||\
                                                          ((__VALUE__) == FL_CAN_TS1_9Tq) ||\
                                                          ((__VALUE__) == FL_CAN_TS1_10Tq) ||\
                                                          ((__VALUE__) == FL_CAN_TS1_11Tq) ||\
                                                          ((__VALUE__) == FL_CAN_TS1_12Tq) ||\
                                                          ((__VALUE__) == FL_CAN_TS1_13Tq) ||\
                                                          ((__VALUE__) == FL_CAN_TS1_14Tq) ||\
                                                          ((__VALUE__) == FL_CAN_TS1_15Tq) ||\
                                                          ((__VALUE__) == FL_CAN_TS1_16Tq))
                                                         
#define     IS_CAN_TS2(__VALUE__)                        (((__VALUE__) == FL_CAN_TS2_1Tq) ||\
                                                          ((__VALUE__) == FL_CAN_TS2_2Tq) ||\
                                                          ((__VALUE__) == FL_CAN_TS2_3Tq) ||\
                                                          ((__VALUE__) == FL_CAN_TS2_4Tq) ||\
                                                          ((__VALUE__) == FL_CAN_TS2_5Tq) ||\
                                                          ((__VALUE__) == FL_CAN_TS2_6Tq) ||\
                                                          ((__VALUE__) == FL_CAN_TS2_7Tq) ||\
                                                          ((__VALUE__) == FL_CAN_TS2_8Tq)) 
            
#define    IS_CAN_TX_PRIORITY(__VALUE__)                 (((__VALUE__) == FL_CAN_TX_PRIORITY_ID) ||\
                                                          ((__VALUE__) == FL_CAN_TX_PRIORITY_BUFFER))
           
           
#define    IS_CAN_FILTER_EN(__VALUE__)                   (((__VALUE__) == FL_ENABLE) ||\
                                                          ((__VALUE__) == FL_DISABLE))
           
#define    IS_CAN_AFx(__VALUE__)                         (((__VALUE__) == FL_CAN_FILTER1) ||\
                                                          ((__VALUE__) == FL_CAN_FILTER2) ||\
                                                          ((__VALUE__) == FL_CAN_FILTER3) ||\
                                                          ((__VALUE__) == FL_CAN_FILTER4) ||\
                                                          ((__VALUE__) == FL_CAN_FILTER5) ||\
                                                          ((__VALUE__) == FL_CAN_FILTER6) ||\
                                                          ((__VALUE__) == FL_CAN_FILTER7) ||\
                                                          ((__VALUE__) == FL_CAN_FILTER8) ||\
                                                          ((__VALUE__) == FL_CAN_FILTER9) ||\
                                                          ((__VALUE__) == FL_CAN_FILTER10) ||\
                                                          ((__VALUE__) == FL_CAN_FILTER11) ||\
                                                          ((__VALUE__) == FL_CAN_FILTER12) ||\
                                                          ((__VALUE__) == FL_CAN_FILTER13) ||\
                                                          ((__VALUE__) == FL_CAN_FILTER14) ||\
                                                          ((__VALUE__) == FL_CAN_FILTER15) ||\
                                                          ((__VALUE__) == FL_CAN_FILTER16))
           
#define    IS_CAN_AFMRx(__VALUE__)                       (((__VALUE__) == FL_CAN_FILTERMASK1) ||\
                                                          ((__VALUE__) == FL_CAN_FILTERMASK2) ||\
                                                          ((__VALUE__) == FL_CAN_FILTERMASK3) ||\
                                                          ((__VALUE__) == FL_CAN_FILTERMASK4))
           
#define    IS_CAN_AFIRx(__VALUE__)                       (((__VALUE__) == FL_CAN_FILTERID1) ||\
                                                          ((__VALUE__) == FL_CAN_FILTERID2) ||\
                                                          ((__VALUE__) == FL_CAN_FILTERID3) ||\
                                                          ((__VALUE__) == FL_CAN_FILTERID4))
                                                                                              
#define    IS_CAN_MODE(__VALUE__)                        (((__VALUE__) == FL_CAN_MODE_NORMAL)   ||\
                                                          ((__VALUE__) == FL_CAN_MODE_LOOPBACK) ||\
                                                          ((__VALUE__) == FL_CAN_MODE_CONFIG)   ||\
                                                          ((__VALUE__) == FL_CAN_MODE_SLEEP))
           
           
#define    IS_CAN_CLK(__VALUE__)                         (((__VALUE__) == FL_CMU_FSCAN_CLK_SOURCE_RCHF) ||\
                                                          ((__VALUE__) == FL_CMU_FSCAN_CLK_SOURCE_XTHF) ||\
                                                          ((__VALUE__) == FL_CMU_FSCAN_CLK_SOURCE_PLL)  ||\
                                                          ((__VALUE__) == FL_CMU_FSCAN_CLK_SOURCE_APBCLK))
           
#define    IS_CAN_ABOM(__VALUE__)                        (((__VALUE__) == FL_CAN_AUTO_MANAGE_HARDWARE)      ||\
                                                          ((__VALUE__) == FL_CAN_AUTO_MANAGE_SOFTWARE_WAIT) ||\
                                                          ((__VALUE__) == FL_CAN_AUTO_MANAGE_SOFTWARE_INTERGRATION))
           
#define    IS_CAN_WAKEUP(__VALUE__)                      (((__VALUE__) == FL_ENABLE) ||\
                                                          ((__VALUE__) == FL_DISABLE))
           
