zmzdh/CAN_st_test/Drivers/FM33FG0xxA_FL_Driver/Src/fm33fg0xxa_fl_can.c
#define    IS_CAN_SRR(__VALUE__)                         (((__VALUE__) == FL_CAN_SRR_BIT_LOW) ||\
                                                          ((__VALUE__) == FL_CAN_SRR_BIT_HIGH))
                                                                          
#define    IS_CAN_STD1SRR(__VALUE__)                     (((__VALUE__) == FL_CAN_STD1SRR_BIT_LOW) ||\
                                                          ((__VALUE__) == FL_CAN_STD1SRR_BIT_HIGH))
                                                                          
#define    IS_CAN_STD2SRR(__VALUE__)                     (((__VALUE__) == FL_CAN_STD2SRR_BIT_LOW) ||\
                                                          ((__VALUE__) == FL_CAN_STD2SRR_BIT_HIGH))
                                                                          
#define    IS_CAN_IDE(__VALUE__)                         (((__VALUE__) == FL_CAN_IDE_BIT_LOW) ||\
                                                          ((__VALUE__) == FL_CAN_IDE_BIT_HIGH))
                                                                          
#define    IS_CAN_STD1IDE(__VALUE__)                     (((__VALUE__) == FL_CAN_STD1IDE_BIT_LOW) ||\
                                                          ((__VALUE__) == FL_CAN_STD1IDE_BIT_HIGH))
                                                                          
#define    IS_CAN_STD2IDE(__VALUE__)                     (((__VALUE__) == FL_CAN_STD2IDE_BIT_LOW) ||\
                                                          ((__VALUE__) == FL_CAN_STD2IDE_BIT_HIGH))
                                                                          
#define    IS_CAN_RTR(__VALUE__)                         (((__VALUE__) == FL_CAN_RTR_BIT_LOW) ||\
                                                          ((__VALUE__) == FL_CAN_RTR_BIT_HIGH))
           
           
#define    IS_CAN_ID29_MASK(__VALUE__)                    ((__VALUE__) <= 0x1FFFFFFFU)
#define    IS_CAN_ID11_MASK(__VALUE__)                    ((__VALUE__) <= 0x7FFU)
                                                                          
#define    IS_CAN_STD1ID29_MASK(__VALUE__)                ((__VALUE__) <= 0X1FFFFFFFU)
#define    IS_CAN_STD1ID11_MASK(__VALUE__)                ((__VALUE__) <= 0x7FFU)
                                                                          
#define    IS_CAN_STD2ID29_MASK(__VALUE__)                ((__VALUE__) <= 0X1FFFFFFFU)
#define    IS_CAN_STD2ID11_MASK(__VALUE__)                ((__VALUE__) <= 0x7FFU)
           
#define    IS_CAN_SRR_MASK(__VALUE__)                    (((__VALUE__) == FL_ENABLE) ||\
                                                          ((__VALUE__) == FL_DISABLE))
           
#define    IS_CAN_IDE_MASK(__VALUE__)                    (((__VALUE__) == FL_ENABLE) ||\
                                                          ((__VALUE__) == FL_DISABLE))
           
#define    IS_CAN_STD1SRR_MASK(__VALUE__)                (((__VALUE__) == FL_ENABLE) ||\
                                                          ((__VALUE__) == FL_DISABLE))
                                                         
#define    IS_CAN_STD1IDE_MASK(__VALUE__)                (((__VALUE__) == FL_ENABLE) ||\
                                                          ((__VALUE__) == FL_DISABLE))
                                                         
#define    IS_CAN_STD2SRR_MASK(__VALUE__)                (((__VALUE__) == FL_ENABLE) ||\
                                                          ((__VALUE__) == FL_DISABLE))
                                                         
#define    IS_CAN_STD2IDE_MASK(__VALUE__)                (((__VALUE__) == FL_ENABLE) ||\
                                                          ((__VALUE__) == FL_DISABLE))
           
#define    IS_CAN_RTR_MASK(__VALUE__)                    (((__VALUE__) == FL_ENABLE) ||\
                                                          ((__VALUE__) == FL_DISABLE))
                                                         
#define    IS_CAN_MASKMODE(__VALUE__)                    (((__VALUE__) == FL_CAN_MASKMODE_ID) ||\
                                                          ((__VALUE__) == FL_CAN_MASKMODE_MASK))
           
#define    IS_CAN_IDMODE(__VALUE__)                      (((__VALUE__) == FL_CAN_IDMODE_16BIT) ||\
                                                          ((__VALUE__) == FL_CAN_IDMODE_32BIT))
/**
  * @}
  */

/* Private consts ------------------------------------------------------------*/
/** @addtogroup CAN_FL_Private_Consts
  * @{
  */


/**
  * @}
  */

/* Private function prototypes -----------------------------------------------*/



/* Exported functions --------------------------------------------------------*/
/** @addtogroup CAN_FL_EF_Init
  * @{
  */

/**
  * @brief  CAN初始化
  * @param  CANx外设入口地址
  * @param  CAN_InitStruct 指向一个@ref FL_CAN_InitTypeDef  结构体的指针
  * @retval 错误状态可能值
  *         -FL_FAIL 配置过程发生错误
  *         -FL_PASS 配置成功
  */
FL_ErrorStatus FL_CAN_Init(CAN_Type *CANx, FL_CAN_InitTypeDef *CAN_InitStruct)
{
    FL_ErrorStatus status = FL_FAIL;
    if(CAN_InitStruct != NULL)
    {
        /*参数检查*/
        assert_param(IS_CAN_INSTANCE(CANx));
        assert_param(IS_CAN_SJW(CAN_InitStruct->SJW));
        assert_param(IS_CAN_TS1(CAN_InitStruct->TS1));
        assert_param(IS_CAN_TS2(CAN_InitStruct->TS2));
        assert_param(IS_CAN_TX_PRIORITY(CAN_InitStruct->TXPriority));
        assert_param(IS_CAN_CLK(CAN_InitStruct->clockSource));
        assert_param(IS_CAN_MODE(CAN_InitStruct->mode));
        assert_param(IS_CAN_WAKEUP(CAN_InitStruct->wakeup));
        assert_param(IS_CAN_ABOM(CAN_InitStruct->ABOM));
        /*时钟总线配置*/
        if(CANx == CAN)
        {
            FL_CMU_EnableGroup3BusClock(FL_CMU_GROUP3_BUSCLK_FSCAN);
            FL_CMU_EnableOperationClock(FL_CMU_OPCLK_FSCAN);
            /*CAN时钟源选择*/
            FL_CMU_SetFSCANClockSource(CAN_InitStruct->clockSource);
        }
        else
        {

