zmzdh/CAN_st_test/Drivers/FM33FG0xxA_FL_Driver/Src/fm33fg0xxa_fl_can.c
        }
        /*复位CAN模块*/
        FL_CAN_EnableSoftwareReset(CANx);
        FL_CAN_SetAutoBusOffManagement(CANx, CAN_InitStruct->ABOM);
        FL_CAN_SetTXPriority(CANx, CAN_InitStruct->TXPriority);
        /*设置重同步宽度*/
        FL_CAN_WriteSyncJumpWidth(CANx, CAN_InitStruct->SJW);
        /*设置时间段11*/
        FL_CAN_WriteTimeSegment1Length(CANx, CAN_InitStruct->TS1);
        /*设置时间段22*/
        FL_CAN_WriteTimeSegment2Length(CANx, CAN_InitStruct->TS2);
        /*设置波特率*/
        FL_CAN_WriteBaudRatePrescaler(CANx, CAN_InitStruct->BRP);
        if(CAN_InitStruct->wakeup == FL_ENABLE)
        {
            FL_CAN_EnableWakeup(CANx);
        }
        else
        {
            FL_CAN_DisableWakeup(CANx);
        }
        if(CAN_InitStruct->AREN  == FL_ENABLE)
        {
            FL_CAN_EnableAutoResend(CANx);
        }
        else
        {
            FL_CAN_DisableAutoResend(CANx);
        }
        if(CAN_InitStruct->mode == FL_CAN_MODE_NORMAL)
        {
            FL_CAN_DisableSleepMode(CANx);
            FL_CAN_DisableLoopBackMode(CANx);    /* Normal模式 */
            FL_CAN_Enable(CANx);
        }
        else if(CAN_InitStruct->mode == FL_CAN_MODE_LOOPBACK)
        {
            FL_CAN_EnableLoopBackMode(CANx);    /* Loop Back模式*/
            FL_CAN_DisableSleepMode(CANx);
            FL_CAN_Enable(CANx);
        }
        else if(CAN_InitStruct->mode == FL_CAN_MODE_SLEEP)
        {
            FL_CAN_EnableSleepMode(CANx);         /*Sleep模式*/
            FL_CAN_DisableLoopBackMode(CANx);
            FL_CAN_Enable(CANx);
        }
        else
        {
            FL_CAN_Disable(CANx);    /* Configuration模式 */
        }
        status = FL_PASS;
    }
    return status;
}

/**
  * @brief  设置 CAN_InitStruct 为默认模式
  * @param  CAN_InitStruct 指向需要将值设置为默认配置的结构体 @ref FL_CAN_InitTypeDef 结构体
  *
  * @retval None
  */
void FL_CAN_StructInit(FL_CAN_InitTypeDef *CAN_InitStruct)
{
    if(CAN_InitStruct != NULL)
    {
        CAN_InitStruct->mode = FL_CAN_MODE_NORMAL;
        CAN_InitStruct->BRP = 0;
        CAN_InitStruct->clockSource = FL_CMU_FSCAN_CLK_SOURCE_RCHF;
        CAN_InitStruct->SJW = FL_CAN_SJW_1Tq;
        CAN_InitStruct->TS1 = FL_CAN_TS1_5Tq;
        CAN_InitStruct->TS2 = FL_CAN_TS2_4Tq;
        CAN_InitStruct->ABOM = FL_CAN_AUTO_MANAGE_HARDWARE;
        CAN_InitStruct->AREN = FL_ENABLE;
        CAN_InitStruct->TXPriority = FL_CAN_TX_PRIORITY_BUFFER;
        CAN_InitStruct->wakeup = FL_DISABLE;
    }
}

/**
  * @brief  CAN滤波器初始化
  * @param  CANx外设入口地址
  * @param  filterX This parameter can be one of the following values:
  *           @arg @ref FL_CAN_FILTER1
  *           @arg @ref FL_CAN_FILTER2
  *           @arg @ref FL_CAN_FILTER3
  *           @arg @ref FL_CAN_FILTER4
  *           @arg @ref FL_CAN_FILTER5
  *           @arg @ref FL_CAN_FILTER6
  *           @arg @ref FL_CAN_FILTER7
  *           @arg @ref FL_CAN_FILTER8
  *           @arg @ref FL_CAN_FILTER9
  *           @arg @ref FL_CAN_FILTER10
  *           @arg @ref FL_CAN_FILTER11
  *           @arg @ref FL_CAN_FILTER12
  *           @arg @ref FL_CAN_FILTER13
  *           @arg @ref FL_CAN_FILTER14
  *           @arg @ref FL_CAN_FILTER15
  *           @arg @ref FL_CAN_FILTER16
  * @param  CAN_InitFilterStruct 指向一个@ref FL_CAN_FilterInitTypeDef  结构体的指针
  * @retval 错误状态可能值
  *         -FL_FAIL 配置过程发生错误
  *         -FL_PASS 配置过程
  */
FL_ErrorStatus FL_CAN_FilterInit(CAN_Type *CANx, FL_CAN_FilterInitTypeDef *CAN_FilterInitStruct, uint32_t filterX)
{
    FL_ErrorStatus status = FL_FAIL;
    if(CAN_FilterInitStruct != NULL)
    {
        assert_param(IS_CAN_SRR(CAN_FilterInitStruct->filterIdSRR));
        assert_param(IS_CAN_IDE(CAN_FilterInitStruct->filterIdIDE));
        assert_param(IS_CAN_STD1SRR(CAN_FilterInitStruct->filterSTD1IdSRR));
        assert_param(IS_CAN_STD1IDE(CAN_FilterInitStruct->filterSTD1IdIDE));
        assert_param(IS_CAN_STD2SRR(CAN_FilterInitStruct->filterSTD2IdSRR));
        assert_param(IS_CAN_STD2IDE(CAN_FilterInitStruct->filterSTD2IdIDE));
        assert_param(IS_CAN_RTR(CAN_FilterInitStruct->filterIdRTR));
        assert_param(IS_CAN_FILTER_EN(CAN_FilterInitStruct->filterEn));
        assert_param(IS_CAN_ID29_MASK(CAN_FilterInitStruct->filterMaskIdExtend));
        assert_param(IS_CAN_ID11_MASK(CAN_FilterInitStruct->filterMaskIdStandard));
        assert_param(IS_CAN_STD1ID29_MASK(CAN_FilterInitStruct->filterSTD1MaskIdExtend));
        assert_param(IS_CAN_STD1ID11_MASK(CAN_FilterInitStruct->filterSTD1MaskIdStandard));
        assert_param(IS_CAN_STD2ID29_MASK(CAN_FilterInitStruct->filterSTD2MaskIdExtend));
        assert_param(IS_CAN_STD2ID11_MASK(CAN_FilterInitStruct->filterSTD2MaskIdStandard));
        assert_param(IS_CAN_SRR_MASK(CAN_FilterInitStruct->filterMaskIdSRR));
        assert_param(IS_CAN_IDE_MASK(CAN_FilterInitStruct->filterMaskIdIDE));
        assert_param(IS_CAN_STD1SRR_MASK(CAN_FilterInitStruct->filterSTD1MaskIdSRR));
        assert_param(IS_CAN_STD1IDE_MASK(CAN_FilterInitStruct->filterSTD1MaskIdIDE));
        assert_param(IS_CAN_STD2SRR_MASK(CAN_FilterInitStruct->filterSTD2MaskIdSRR));
        assert_param(IS_CAN_STD2IDE_MASK(CAN_FilterInitStruct->filterSTD2MaskIdIDE));
        assert_param(IS_CAN_RTR_MASK(CAN_FilterInitStruct->filterMaskIdRTR));
        assert_param(IS_CAN_IDMODE(CAN_FilterInitStruct->filterIDMode));
        assert_param(IS_CAN_MASKMODE(CAN_FilterInitStruct->filterMaskMode));
        assert_param(IS_CAN_AFx(filterX));
        while(FL_CAN_IsActiveFlag_FilterBusy(CANx) != 0)
        {
        }
        /* 掩码模式设置*/
        FL_CAN_Filter_SetMaskMode(CANx, filterX, CAN_FilterInitStruct->filterMaskMode);
        /* ID模式设置*/
        FL_CAN_Filter_SetIDMode(CANx, filterX, CAN_FilterInitStruct->filterIDMode);
        /* 滤波器32bit模式 */
        if(CAN_FilterInitStruct->filterIDMode  == FL_CAN_IDMODE_32BIT)
        {
            if(CAN_FilterInitStruct->filterIdIDE == FL_CAN_IDE_BIT_HIGH)
            {   /* 滤波器ID设置 */
                FL_CAN_FilterEXT_WriteIDCompare(CANx, filterX, ((CAN_FilterInitStruct->filterIdExtend) >> 18) & 0X000007FFU);
                FL_CAN_FilterEXT_WriteEXTIDCompare(CANx, filterX, (CAN_FilterInitStruct->filterIdExtend) & 0X0003FFFFU);
            }
            else
            {   /* 滤波器ID设置 */
                FL_CAN_FilterEXT_WriteIDCompare(CANx, filterX, (CAN_FilterInitStruct->filterIdStandard) & 0X000007FFU);
            }
            
