zmzdh/CAN_st_test/Drivers/FM33FG0xxA_FL_Driver/Src/fm33fg0xxa_fl_can.c
            if (((CAN_FilterInitStruct->filterMaskMode == FL_CAN_MASKMODE_MASK) && (CAN_FilterInitStruct->filterIdIDE == FL_CAN_IDE_BIT_HIGH)) ||
                ((CAN_FilterInitStruct->filterMaskMode == FL_CAN_MASKMODE_ID) && (CAN_FilterInitStruct->filterMaskIdIDE == FL_ENABLE)))
            {   /* 滤波器ID掩码设置 */
                FL_CAN_FilterEXT_WriteIDCompareMask(CANx, filterX, ((CAN_FilterInitStruct->filterMaskIdExtend) >> 18) & 0X000007FFU);
                FL_CAN_FilterEXT_WriteEXTIDCompareMask(CANx, filterX, (CAN_FilterInitStruct->filterMaskIdExtend) & 0X0003FFFFU);
            }
            else
            {   /* 滤波器ID掩码设置 */
                FL_CAN_FilterEXT_WriteIDCompareMask(CANx, filterX, (CAN_FilterInitStruct->filterMaskIdStandard) & 0X000007FFU);
            }
            
            FL_CAN_FilterEXT_SetSRRCompare(CANx, filterX, CAN_FilterInitStruct->filterIdSRR);
            /* 滤波器ID设置 */
            FL_CAN_FilterEXT_SetIDECompare(CANx, filterX, CAN_FilterInitStruct->filterIdIDE);
            FL_CAN_FilterEXT_SetRTRCompare(CANx, filterX, CAN_FilterInitStruct->filterIdRTR);
            if((CAN_FilterInitStruct->filterMaskIdSRR) == FL_ENABLE)   
            {   /* SRR参与滤波器比较 */
                FL_CAN_FilterEXT_EnableSRRCompare(CANx, filterX);
            }
            else
            {
                FL_CAN_FilterEXT_DisableSRRCompare(CANx, filterX);
            }
            if((CAN_FilterInitStruct->filterMaskIdIDE) == FL_ENABLE)
            {   /* IDE位参与滤波器比较 */
                FL_CAN_FilterEXT_EnableIDECompare(CANx, filterX);
            }
            else
            {
                FL_CAN_FilterEXT_DisableIDECompare(CANx, filterX);
            }
            if((CAN_FilterInitStruct->filterMaskIdRTR) == FL_ENABLE)
            {   /* RTR位参与滤波器比较 */
                FL_CAN_FilterEXT_EnableRTRCompare(CANx, filterX);
            }
            else
            {
                FL_CAN_FilterEXT_DisableRTRCompare(CANx, filterX);
            }
        }
        else /* 滤波器16bit模式 */
        {
            /* 滤波器低16位参数设置 */
            if(CAN_FilterInitStruct->filterSTD1IdIDE == FL_CAN_STD1IDE_BIT_HIGH)
            {   /* 滤波器1 ID设置 */
                FL_CAN_FilterSTD1_WriteIDCompare(CANx, filterX, ((CAN_FilterInitStruct->filterSTD1IdExtend) >> 18) & 0X000007FFU);
                FL_CAN_FilterSTD1_WriteEXTIDCompare(CANx, filterX, ((CAN_FilterInitStruct->filterSTD1IdExtend >> 15)) & 0X7U);
            }
            else
            {   /* 滤波器1 ID设置 */
                FL_CAN_FilterSTD1_WriteIDCompare(CANx, filterX, (CAN_FilterInitStruct->filterSTD1IdStandard) & 0X000007FFU);
            }
            
            if (((CAN_FilterInitStruct->filterMaskMode == FL_CAN_MASKMODE_MASK) && (CAN_FilterInitStruct->filterSTD1IdIDE == FL_CAN_STD1IDE_BIT_HIGH)) ||
                ((CAN_FilterInitStruct->filterMaskMode == FL_CAN_MASKMODE_ID) && (CAN_FilterInitStruct->filterSTD1MaskIdIDE == FL_ENABLE)))
            {   /* 滤波器1 ID掩码设置 */
                FL_CAN_FilterSTD1_WriteIDCompareMask(CANx, filterX, (CAN_FilterInitStruct->filterSTD1MaskIdExtend >> 18) & 0X000007FFU);
                FL_CAN_FilterSTD1_WriteEXTIDCompareMask(CANx, filterX, (CAN_FilterInitStruct->filterSTD1MaskIdExtend >> 15) & 0X7U);
            }
            else
            {   /* 滤波器1 ID掩码设置 */
                FL_CAN_FilterSTD1_WriteIDCompareMask(CANx, filterX, (CAN_FilterInitStruct->filterSTD1MaskIdStandard) & 0X000007FFU);
            }
            FL_CAN_FilterSTD1_SetSRRCompare(CANx, filterX, CAN_FilterInitStruct->filterSTD1IdSRR);
            FL_CAN_FilterSTD1_SetIDECompare(CANx, filterX, CAN_FilterInitStruct->filterSTD1IdIDE);
            if((CAN_FilterInitStruct->filterSTD1MaskIdSRR) == FL_ENABLE)
            {   /* SRR参与滤波器比较 */
                FL_CAN_FilterSTD1_EnableSRRCompare(CANx, filterX);
            }
            else
            {
                FL_CAN_FilterSTD1_DisableSRRCompare(CANx, filterX);
            }
            if((CAN_FilterInitStruct->filterSTD1MaskIdIDE) == FL_ENABLE)
            {   /* IDE位参与滤波器比较 */
                FL_CAN_FilterSTD1_EnableIDECompare(CANx, filterX);
            }
            else
            {
                FL_CAN_FilterSTD1_DisableIDECompare(CANx, filterX);
            }
            
            
            /* 滤波器高16位参数设置 */
            if(CAN_FilterInitStruct->filterSTD2IdIDE == FL_CAN_STD2IDE_BIT_HIGH)
            {   /* 滤波器2 ID设置 */
                FL_CAN_FilterSTD2_WriteIDCompare(CANx, filterX, ((CAN_FilterInitStruct->filterSTD2IdExtend) >> 18) & 0X000007FFU);
                FL_CAN_FilterSTD2_WriteEXTIDCompare(CANx, filterX, ((CAN_FilterInitStruct->filterSTD2IdExtend >> 15)) & 0X7U);
            }
            else
            {   /* 滤波器2 ID设置 */
                FL_CAN_FilterSTD2_WriteIDCompare(CANx, filterX, (CAN_FilterInitStruct->filterSTD2IdStandard) & 0X000007FFU);
            }
            
            if (((CAN_FilterInitStruct->filterMaskMode == FL_CAN_MASKMODE_MASK) && (CAN_FilterInitStruct->filterSTD2IdIDE == FL_CAN_STD2IDE_BIT_HIGH)) ||
                ((CAN_FilterInitStruct->filterMaskMode == FL_CAN_MASKMODE_ID) && (CAN_FilterInitStruct->filterSTD2MaskIdIDE == FL_ENABLE)))
            {   /* 滤波器2 ID掩码设置 */
                FL_CAN_FilterSTD2_WriteIDCompareMask(CANx, filterX, ((CAN_FilterInitStruct->filterSTD2MaskIdExtend) >> 18) & 0X000007FFU);
                FL_CAN_FilterSTD2_WriteEXTIDCompareMask(CANx, filterX, ((CAN_FilterInitStruct->filterSTD2MaskIdExtend) >> 15) & 0X7U);
            }
            else
            {   /* 滤波器2 ID掩码设置 */
                FL_CAN_FilterSTD2_WriteIDCompareMask(CANx, filterX, ((CAN_FilterInitStruct->filterSTD2MaskIdStandard)) & 0X000007FFU);
            }
            FL_CAN_FilterSTD2_SetSRRCompare(CANx, filterX, CAN_FilterInitStruct->filterSTD2IdSRR);
            FL_CAN_FilterSTD2_SetIDECompare(CANx, filterX, CAN_FilterInitStruct->filterSTD2IdIDE);
            if((CAN_FilterInitStruct->filterSTD2MaskIdSRR) == FL_ENABLE)
            {   /* SRR参与滤波器比较 */
                FL_CAN_FilterSTD2_EnableSRRCompare(CANx, filterX);
            }
            else
            {
                FL_CAN_FilterSTD2_DisableSRRCompare(CANx, filterX);
            }
            if((CAN_FilterInitStruct->filterSTD2MaskIdIDE) == FL_ENABLE)
            {   /* IDE位参与滤波器比较 */
                FL_CAN_FilterSTD2_EnableIDECompare(CANx, filterX);
            }
            else
            {
                FL_CAN_FilterSTD2_DisableIDECompare(CANx, filterX);
            }
        }
        if((CAN_FilterInitStruct->filterEn) == FL_ENABLE)
        {   /* 滤波器使能 */
            FL_CAN_Filter_Enable(CANx, filterX);
        }
        else
        {
            FL_CAN_Filter_Disable(CANx, filterX);
        }
        status = FL_PASS;
    }
    return status;
}
/**
  * @brief  设置CAN_FilterInitStruct 为默认配置
  * @param  CAN_FilterInitStruct 指向需要将值设置为默认的结构体 @ref FL_CAN_FilterInitTypeDef 结构体
  *
  * @retval None
  */
void FL_CAN_StructFilterInit(FL_CAN_FilterInitTypeDef *CAN_FilterInitStruct)
{
    if(CAN_FilterInitStruct != NULL)
    {
        CAN_FilterInitStruct->filterEn = FL_DISABLE;
        CAN_FilterInitStruct->filterIdExtend = 0;
        CAN_FilterInitStruct->filterMaskIdStandard = 0x7FF;
        CAN_FilterInitStruct->filterIdIDE = FL_CAN_IDE_BIT_LOW;
        CAN_FilterInitStruct->filterMaskIdIDE = FL_DISABLE;
        CAN_FilterInitStruct->filterMaskIdExtend = 0x1FFFFFFF;
        CAN_FilterInitStruct->filterIdRTR = FL_CAN_RTR_BIT_LOW;
        CAN_FilterInitStruct->filterMaskIdRTR = FL_DISABLE;
        CAN_FilterInitStruct->filterIdSRR = FL_CAN_SRR_BIT_LOW;
        CAN_FilterInitStruct->filterMaskIdSRR = FL_DISABLE;
        CAN_FilterInitStruct->filterIdStandard = 0;
        CAN_FilterInitStruct->filterSTD1IdExtend = 0;
        CAN_FilterInitStruct->filterSTD1MaskIdStandard = 0x7FF;
        CAN_FilterInitStruct->filterSTD1IdIDE = FL_CAN_IDE_BIT_LOW;
        CAN_FilterInitStruct->filterSTD1MaskIdIDE = FL_DISABLE;
        CAN_FilterInitStruct->filterSTD1MaskIdExtend = 0x1FFFFFFF;
        CAN_FilterInitStruct->filterSTD1IdSRR = FL_CAN_SRR_BIT_LOW;
        CAN_FilterInitStruct->filterSTD1MaskIdSRR = FL_DISABLE;
        CAN_FilterInitStruct->filterSTD1IdStandard = 0;
        CAN_FilterInitStruct->filterSTD2IdExtend = 0;
        CAN_FilterInitStruct->filterSTD2MaskIdStandard = 0x7FF;
        CAN_FilterInitStruct->filterSTD2IdIDE = FL_CAN_IDE_BIT_LOW;
        CAN_FilterInitStruct->filterSTD2MaskIdIDE = FL_DISABLE;
        CAN_FilterInitStruct->filterSTD2MaskIdExtend = 0x1FFFFFFF;
        CAN_FilterInitStruct->filterSTD2IdSRR = FL_CAN_SRR_BIT_LOW;
        CAN_FilterInitStruct->filterSTD2MaskIdSRR = FL_DISABLE;
        CAN_FilterInitStruct->filterSTD2IdStandard = 0;
    }
}


/**
  * @}
  */

/* Private functions ---------------------------------------------------------*/
/** @defgroup CAN_FL_Private_Functions CAN Private Functions
  * @{
  */

/* #error 在此处编写私有函数，并删除该行 */

/**
  * @}
  */

#endif /* FL_CAN_DRIVER_ENABLED */

/**
  * @}
  */

/**
  * @}
  */

/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/

